Workspace/test_cases/vertificating/04-porousChannel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)
    (50 0 0)
    (50 1 0)
    (0 1 0)
    (0 0 0.001)
    (50 0 0.001)
    (50 1 0.001)
    (0 1 0.001)	
 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 20 1) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    Inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
          
        );
    }
    Outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    Wall
    {
        type wall;
        faces
        (
            (3 2 6 7)
        );
    }
    symmetry
    {
        type symmetry;
        faces
        (
            (0 1 5 4)
        );
    }
    Frontback
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }
    
);

mergePatchPairs
(
);

// ************************************************************************* //
