Workspace/test_cases/vertificating/04-porousChannel/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


       actions
(
    {
        name    porousCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.02 0.0005 0)(0.03 1 1e-6);
        }
    }
    {
        name    porousCells;
        type     cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set porousCellSet;
        }
    } 
);

// ************************************************************************* //
